"""Модуль для Классов и Категорий"""


class Product:
    """Класс для представления товара"""

    def __init__(
        self, name: str, description: str, price: float, quantity: int
    ) -> None:
        self.name = name
        self.description = description
        self.quantity = quantity
        # Задание 4: Используем сеттер при создании объекта, чтобы проверить цену
        self.price = price

    @property
    def price(self) -> float:
        """Геттер для получения приватной цены"""
        return self.__price

    @price.setter
    def price(self, new_price: float) -> None:
        """Сеттер для изменения цены с проверкой корректности"""
        if new_price <= 0:
            print("Цена не должна быть нулевая или отрицательная")
        else:
            self.__price = new_price

    @classmethod
    def new_product(cls, data: dict):
        """Задание 3: Класс-метод для создания объекта Product из словаря"""
        return cls(
            name=data["name"],
            description=data["description"],
            price=data["price"],
            quantity=data["quantity"],
        )


class Category:
    """Класс для представления категории товаров"""

    # Атрибуты класса для хранения общей информации
    category_count = 0  # Общее количество категорий
    product_count = 0  # Общее количество уникальных товаров в списке

    def __init__(
        self, name: str, description: str, products: list[Product]
    ) -> None:
        self.name = name
        self.description = description

        # Задание 1: Делаем список приватным (два подчеркивания)
        self.__products = []

        # Автоматическое заполнение атрибутов класса при создании нового объекта
        Category.category_count += 1

        # Заполняем приватный список через созданный метод
        for product in products:
            self.add_product(product)

    def add_product(self, product: Product) -> None:
        """Задание 1: Метод для добавления продукта в приватный список категории"""
        self.__products.append(product)
        # Увеличиваем счетчик уникальных товаров при каждом добавлении
        Category.product_count += 1

    @property
    def products(self) -> str:
        """Задание 2: Геттер для вывода списка товаров в виде строк"""
        result = []
        for product in self.__products:
            # Формируем строку по шаблону: Название продукта, 80 руб. Остаток: 15 шт.
            product_str = f"{product.name}, {int(product.price)} руб. Остаток: {product.quantity} шт."
            result.append(product_str)

        # Объединяем все строки через перенос на новую строку
        return "\n".join(result)


# --- ВАШ ПРОВЕРОЧНЫЙ КОД ---
if __name__ == "__main__":
    product1 = Product(
        "Samsung Galaxy S23 Ultra",
        "256GB, Серый цвет, 200MP камера",
        180000.0,
        5,
    )
    product2 = Product("Iphone 15", "512GB, Gray space", 210000.0, 8)
    product3 = Product("Xiaomi Redmi Note 11", "1024GB, Синий", 31000.0, 14)

    category1 = Category(
        "Смартфоны",
        "Смартфоны, как средство не только коммуникации, но и получения дополнительных функций для удобства жизни",
        [product1, product2, product3],
    )

    print(category1.products)
    product4 = Product('55" QLED 4K', "Фоновая подсветка", 123000.0, 7)
    category1.add_product(product4)
    print(category1.products)
    print(category1.product_count)

    new_product = Product.new_product(
        {
            "name": "Samsung Galaxy S23 Ultra",
            "description": "256GB, Серый цвет, 200MP камера",
            "price": 180000.0,
            "quantity": 5,
        }
    )
    print(new_product.name)
    print(new_product.description)
    print(new_product.price)
    print(new_product.quantity)

    new_product.price = 800
    print(new_product.price)

    new_product.price = -100
    print(new_product.price)
    new_product.price = 0
    print(new_product.price)

